Repository: CodeMOOC/CodyMaze-Bot-v2
Catalog: src/CodyMazeBot/Strings.*.resx
Languages: it

# AcceptCoordinateWaitForDirection
source: 👀 What direction are you facing?
it: 👀 In che direzione stai guardando?

# AssignCode
source: 🔢 Execute the following instructions and scan the QR Code you stop on: <code>{0}</code>
it: 🔢 Esegui le seguenti istruzioni e poi scansiona il codice QR sul quale ti fermi: <code>{0}</code>

# CannotHandle
source: Sorry, I don't understand.
it: Scusa, non ho capito.

# CertificateAskForName
source: 📃 <b>Certificate</b> Send me a message with your full name, that will be put on the certificate of completion.
it: 📃 <b>Certificato</b> Scrivimi il tuo nome completo per la generazione del certificato.

# CertificateAskForNameAgain
source: OK. Tell me your full name please.
it: OK. Scrivimi il tuo nome completo.

# CertificateAskForNameConfirmation
source: Your name is <i>“{0}”</i>. Correct?
it: Il tuo nome è <i>“{0}”</i>. È corretto?

# CertificateAskForNameInvalid
source: That nome doesn’t look right to me. Could you please write your full name?
it: Il nome non mi sembra valido, mi puoi scrivere il tuo nome completo?

# CertificateGenerationCaption
source: Your CodyMaze completion certificate
it: Il tuo certificato di completamento di CodyMaze

# CertificateGenerationDescriptionEvent
source: has successfully completed the “{0}” activity , interpreting sequences of instructions with repetition and selection constructs.
it: ha completato con successo l’attività “{0}”, interpretando sequenze di istruzioni con costrutti di ripetizione e di selezione.

# CertificateGenerationDescriptionPlain
source: has successfully completed the “Hour of Code” activity with CodyMaze, interpreting sequences of instructions with repetition and selection constructs.
it: ha completato con successo l’attività di “Hour of Code” con CodyMaze, interpretando sequenze di istruzioni con costrutti di ripetizione e di selezione.

# CertificateGenerationError
source: 🚨 Whoops, there was an error generating your certificate.
it: 🚨 Ops, si è verificato un errore nella generazione del certificato.

# CertificateGenerationProcessing
source: ✒ Generating your certificate…
it: ✒ Sto generando il tuo certificato...

# CertificateGenerationReleasedOn
source: Released on
it: Rilasciato

# CertificateGenerationTitle
source: Certificate of completion
it: Certificato di completamento

# CodeElse
source: else
it: altrimenti

# CodeForward
source: f
it: a

# CodeIf
source: if
it: se

# CodeLeft
source: l
it: s

# CodeNoStar
source: no star
it: no stella

# CodePathAhead
source: path ahead
it: strada davanti

# CodePathLeft
source: path left
it: strada a sx

# CodePathRight
source: path right
it: strada a dx

# CodeRight
source: r
it: d

# CodeStar
source: star
it: stella

# CodeWhile
source: while
it: finché

# ConfirmationYes
source: Yes
it: Sì

# CorrectAnswer
source: ✔ <b>Correct!</b>
it: ☑ <b>Giusto!</b>

# CorrectPosition
source: Very well! You're in the right spot ({0}) and you're looking {1}.
it: Molto bene! Sei nel posto giusto ({0}) e stai guardando {1}.

# CriticalError
source: 🚨 <b>Error</b> I'm terribly sorry, something went wrong. Please restart the game using the /reset command.
it: 🚨 <b>Errore</b> Sono spiacente, qualcosa è andato storto. Riavvia il gioco usando il comando /reset, per favore.

# DirectionEast
source: East
it: Est

# DirectionNorth
source: North
it: Nord

# DirectionSouth
source: South
it: Sud

# DirectionWest
source: West
it: Ovest

# FacingEast
source: eastwards
it: verso est

# FacingNorth
source: northwards
it: verso nord

# FacingSouth
source: southwards
it: verso sud

# FacingWest
source: westwards
it: verso ovest

# GameComplete
source: <b>You have completed the game.</b> Thank you for playing! 🎖 Use the /reset command if you want to play again.
it: <b>Hai completato il gioco.</b> Grazie mille per aver partecipato! 🎖 Usa il comando /reset se desideri giocare nuovamente.

# GameCompletePrompt
source: Do you want to play again? Use the /reset command.
it: Vuoi giocare di nuovo? Usa il comando /reset.

# Help1
source: 🤖 Hi! I am the <b>CodyMaze bot</b> and I will guide you through the game. The game is composed of <b>13 challenges</b>: for each one, I will send you new instructions that you must follow exactly in order to reach the final destination on the game’s chessboard.
it: 🤖 Ciao! Sono il <b>bot di CodyMaze</b> e ti guiderò durante il gioco. Una partita è composta da <b>13 sfide</b>: per ogni sfida, ti invierò delle istruzioni che dovrai seguire esattamente in modo da raggiungere la destinazione finale della scacchiera.

# Help2
source: In order to start playing, please scan the QR Code on one of the outer squares of the chessboard (that is, any square along the first or last row, or the first or last column). You may use any QR Code scanner application to do so.
it: Per iniziare a giocare, ti prego di scansionare uno dei QR Code che si trovano lunga il bordo della scacchiera (sarebbe a dire, un codice qualsiasi sulla prima o ultima riga, o sulla prima o ultima colonna). Potrai usare qualsiasi applicazione di scansione dei QR Code per farlo.

# Help3
source: The instructions I will send you may contain the following commands: <code>f</code>: move forward, <code>l</code>: turn left, <code>r</code>: turn right, and other commands such as <code>if</code>, <code>else</code>, and <code>while</code>. Code blocks are indicated between braces (<code>{}</code>) and can be repeated. For instance, <code>2{fr}</code> tells you to move forward and turn right twice.
it: Le istruzioni che ti invierò per spostarti nella scacchiera potranno contenere i seguenti comandi: <code>f</code>: muoviti avanti, <code>l</code>: ruota a sinistra di 90 gradi, <code>r</code>: ruota a destra di 90 gradi, e altre istruzioni come <code>if</code>, <code>else</code>, e <code>while</code>. I blocchi di codice tra parentesi graffe (<code>{}</code>) potranno essere ripetute. Ad esempio, <code>2{fr}</code> vuol dire che dovrai andare avanti e ruotare a destra due volte, in sequenza.

# LanguageCommandAsk
source: Which language should I speak?
it: Che lingua vuoi parlare?

# LanguageConfirm
source: Sure!
it: Va bene!

# ResetCommandOk
source: Let's start from the top! 👍 Scan one of the QR Codes on the outer squares of the chessboard to begin.
it: Ricominciamo! 👍 Scansiona uno dei QR Code lungo il bordo della scacchiera per iniziare a giocare.

# StartCommand
source: 🤖 Hello, I am the <b>CodyMaze bot</b>! Please go to any of the grid’s outer squares and scan the QR Code you find there.
it: 🤖 Ciao, sono il <b>bot di CodyMaze</b>! Vai su una delle caselle lungo il bordo esterno della scacchiera e scansiona il codice QR che trovi lì.

# StartCommandCoordInvalid
source: Hmmm, the command you sent is not valid. Try scanning the CodyMaze QR Code again.
it: Hmmm, il codice che hai scansionato non sembra valido. Riprova a scansionare uno dei codici QR della scacchiera.

# Victory
source: 👏 Congratulations, you have completed CodyMaze!
it: 👏 Congratulazioni, hai completato CodyMaze!

# WaitForLocationFirstCoordinateWrong
source: Invalid start position: please go to any square of the grid's outer border and scan the QR Code you find there.
it: Posizione di inizio non valida: ti prego di andare su una delle caselle lungo il bordo esterno della scacchiera e scansione il codice QR che è lì.

# WaitForLocationFirstSendDirection
source: 🧭 Please turn {0}.
it: 🧭 Girati {0}.

# WaitForLocationWrongDirection
source: ❌ You should be facing <b>{0}</b>. Please confirm clicking on the buttons above.
it: ❌ Dovresti guardare <b>{0}</b>. Conferma cliccando su un pulsante sopra.

# WelcomeGame
source: 🤖 Hello {0}, welcome to <b>{1}</b>! Let's start the game.
it: 🤖 Ciao {0}, ti do il benvenuto al gioco <b>{1}</b>! Iniziamo a giocare.

# WrongAnswerTryAgain
source: ❌ <b>Wrong!</b> Try again.
it: ❌ <b>Sbagliato!</b> Prova di nuovo.

# WrongMove
source: 🚩 <b>Wrong move!</b> Move back to position {0} and look {1}, then try executing the following instructions again: <code>{2}</code>
it: 🚩 <b>Mossa sbagliata!</b> Torna in posizione {0} e guarda {1}, dopodiché esegui nuovamente le istruzioni: <code>{2}</code>
